QX-C2000-DSP/f280049revb_evb_examples/libs/driverlib/inc/hw_dcsm.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the B0_SECTSTAT register
//
//*************************************************************************************************
#define DCSM_B0_SECTSTAT_STATUS_SECT0_S  0U
#define DCSM_B0_SECTSTAT_STATUS_SECT0_M  0x3U // Zone Status Flash BANK0 Sector 0
#define DCSM_B0_SECTSTAT_STATUS_SECT1_S  2U
#define DCSM_B0_SECTSTAT_STATUS_SECT1_M  0xCU // Zone Status Flash BANK0 sector 1
#define DCSM_B0_SECTSTAT_STATUS_SECT2_S  4U
#define DCSM_B0_SECTSTAT_STATUS_SECT2_M  0x30U // Zone Status Flash BANK0 Sector 2
#define DCSM_B0_SECTSTAT_STATUS_SECT3_S  6U
#define DCSM_B0_SECTSTAT_STATUS_SECT3_M  0xC0U // Zone Status Flash BANK0 Sector 3
#define DCSM_B0_SECTSTAT_STATUS_SECT4_S  8U
#define DCSM_B0_SECTSTAT_STATUS_SECT4_M  0x300U // Zone Status Flash BANK0 Sector 4
#define DCSM_B0_SECTSTAT_STATUS_SECT5_S  10U
#define DCSM_B0_SECTSTAT_STATUS_SECT5_M  0xC00U // Zone Status Flash BANK0 Sector 5
#define DCSM_B0_SECTSTAT_STATUS_SECT6_S  12U
#define DCSM_B0_SECTSTAT_STATUS_SECT6_M  0x3000U // Zone Status Flash BANK0 Sector 6
#define DCSM_B0_SECTSTAT_STATUS_SECT7_S  14U
#define DCSM_B0_SECTSTAT_STATUS_SECT7_M  0xC000U // Zone Status Flash BANK0 Sector 7
#define DCSM_B0_SECTSTAT_STATUS_SECT8_S  16U
#define DCSM_B0_SECTSTAT_STATUS_SECT8_M  0x30000U // Zone Status Flash BANK0 sector 8
#define DCSM_B0_SECTSTAT_STATUS_SECT9_S  18U
#define DCSM_B0_SECTSTAT_STATUS_SECT9_M  0xC0000U // Zone Status Flash BANK0 Sector 9
#define DCSM_B0_SECTSTAT_STATUS_SECT10_S 20U
#define DCSM_B0_SECTSTAT_STATUS_SECT10_M 0x300000U // Zone Status Flash BANK0 Sector 10
#define DCSM_B0_SECTSTAT_STATUS_SECT11_S 22U
#define DCSM_B0_SECTSTAT_STATUS_SECT11_M 0xC00000U // Zone Status Flash BANK0 Sector 11
#define DCSM_B0_SECTSTAT_STATUS_SECT12_S 24U
#define DCSM_B0_SECTSTAT_STATUS_SECT12_M 0x3000000U // Zone Status Flash BANK0 Sector 12
#define DCSM_B0_SECTSTAT_STATUS_SECT13_S 26U
#define DCSM_B0_SECTSTAT_STATUS_SECT13_M 0xC000000U // Zone Status Flash BANK0 Sector 13
#define DCSM_B0_SECTSTAT_STATUS_SECT14_S 28U
#define DCSM_B0_SECTSTAT_STATUS_SECT14_M 0x30000000U // Zone Status Flash BANK0 Sector 14
#define DCSM_B0_SECTSTAT_STATUS_SECT15_S 30U
#define DCSM_B0_SECTSTAT_STATUS_SECT15_M 0xC0000000U // Zone Status Flash BANK0 Sector 15

//*************************************************************************************************
//
// The following are defines for the bit fields in the RAMSTAT register
//
//*************************************************************************************************
#define DCSM_RAMSTAT_STATUS_RAM0_S 0U
#define DCSM_RAMSTAT_STATUS_RAM0_M 0x3U // Zone Status RAM LS0
#define DCSM_RAMSTAT_STATUS_RAM1_S 2U
#define DCSM_RAMSTAT_STATUS_RAM1_M 0xCU // Zone Status RAM LS1
#define DCSM_RAMSTAT_STATUS_RAM2_S 4U
#define DCSM_RAMSTAT_STATUS_RAM2_M 0x30U // Zone Status RAM LS2
#define DCSM_RAMSTAT_STATUS_RAM3_S 6U
#define DCSM_RAMSTAT_STATUS_RAM3_M 0xC0U // Zone Status RAM LS3
#define DCSM_RAMSTAT_STATUS_RAM4_S 8U
#define DCSM_RAMSTAT_STATUS_RAM4_M 0x300U // Zone Status RAM LS4
#define DCSM_RAMSTAT_STATUS_RAM5_S 10U
#define DCSM_RAMSTAT_STATUS_RAM5_M 0xC00U // Zone Status RAM LS5
#define DCSM_RAMSTAT_STATUS_RAM6_S 12U
#define DCSM_RAMSTAT_STATUS_RAM6_M 0x3000U // Zone Status RAM LS6
#define DCSM_RAMSTAT_STATUS_RAM7_S 14U
#define DCSM_RAMSTAT_STATUS_RAM7_M 0xC000U // Zone Status RAM LS7

//*************************************************************************************************
//
// The following are defines for the bit fields in the B1_SECTSTAT register
//
//*************************************************************************************************
#define DCSM_B1_SECTSTAT_STATUS_SECT0_S  0U
#define DCSM_B1_SECTSTAT_STATUS_SECT0_M  0x3U // Zone Status Flash BANK1 Sector 0
#define DCSM_B1_SECTSTAT_STATUS_SECT1_S  2U
#define DCSM_B1_SECTSTAT_STATUS_SECT1_M  0xCU // Zone Status Flash BANK1 sector 1
#define DCSM_B1_SECTSTAT_STATUS_SECT2_S  4U
#define DCSM_B1_SECTSTAT_STATUS_SECT2_M  0x30U // Zone Status Flash BANK1 Sector 2
#define DCSM_B1_SECTSTAT_STATUS_SECT3_S  6U
#define DCSM_B1_SECTSTAT_STATUS_SECT3_M  0xC0U // Zone Status Flash BANK1 Sector 3
#define DCSM_B1_SECTSTAT_STATUS_SECT4_S  8U
#define DCSM_B1_SECTSTAT_STATUS_SECT4_M  0x300U // Zone Status Flash BANK1 Sector 4
#define DCSM_B1_SECTSTAT_STATUS_SECT5_S  10U
#define DCSM_B1_SECTSTAT_STATUS_SECT5_M  0xC00U // Zone Status Flash BANK1 Sector 5
#define DCSM_B1_SECTSTAT_STATUS_SECT6_S  12U
#define DCSM_B1_SECTSTAT_STATUS_SECT6_M  0x3000U // Zone Status Flash BANK1 Sector 6
#define DCSM_B1_SECTSTAT_STATUS_SECT7_S  14U
#define DCSM_B1_SECTSTAT_STATUS_SECT7_M  0xC000U // Zone Status Flash BANK1 Sector 7
#define DCSM_B1_SECTSTAT_STATUS_SECT8_S  16U
#define DCSM_B1_SECTSTAT_STATUS_SECT8_M  0x30000U // Zone Status Flash BANK1 sector 8
#define DCSM_B1_SECTSTAT_STATUS_SECT9_S  18U
#define DCSM_B1_SECTSTAT_STATUS_SECT9_M  0xC0000U // Zone Status Flash BANK1 Sector 9
#define DCSM_B1_SECTSTAT_STATUS_SECT10_S 20U
#define DCSM_B1_SECTSTAT_STATUS_SECT10_M 0x300000U // Zone Status Flash BANK1 Sector 10
#define DCSM_B1_SECTSTAT_STATUS_SECT11_S 22U
#define DCSM_B1_SECTSTAT_STATUS_SECT11_M 0xC00000U // Zone Status Flash BANK1 Sector 11
#define DCSM_B1_SECTSTAT_STATUS_SECT12_S 24U
#define DCSM_B1_SECTSTAT_STATUS_SECT12_M 0x3000000U // Zone Status Flash BANK1 Sector 12
#define DCSM_B1_SECTSTAT_STATUS_SECT13_S 26U
#define DCSM_B1_SECTSTAT_STATUS_SECT13_M 0xC000000U // Zone Status Flash BANK1 Sector 13
#define DCSM_B1_SECTSTAT_STATUS_SECT14_S 28U
#define DCSM_B1_SECTSTAT_STATUS_SECT14_M 0x30000000U // Zone Status Flash BANK1 Sector 14
#define DCSM_B1_SECTSTAT_STATUS_SECT15_S 30U
#define DCSM_B1_SECTSTAT_STATUS_SECT15_M 0xC0000000U // Zone Status Flash BANK1 Sector 15

//*************************************************************************************************
//
// The following are defines for the bit fields in the SECERRSTAT register
//
//*************************************************************************************************
#define DCSM_SECERRSTAT_ERR 0x1U // Security Configuration load Error Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the SECERRCLR register
//
//*************************************************************************************************
#define DCSM_SECERRCLR_ERR 0x1U // Clear Security Configuration Load Error Status Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SECERRFRC register
//
//*************************************************************************************************
#define DCSM_SECERRFRC_ERR 0x1U // Set Security Configuration Load Error Status Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the B1_Z1_LINKPOINTER register
//
//*************************************************************************************************
#define DCSM_B1_Z1_LINKPOINTER_LINKPOINTER_S 0U
#define DCSM_B1_Z1_LINKPOINTER_LINKPOINTER_M 0x1FFFFFFFU // Zone1 LINK Pointer in Flash BANK1

//*************************************************************************************************
//
// The following are defines for the bit fields in the B1_Z1_LINKPOINTERERR register
//
//*************************************************************************************************
#define DCSM_B1_Z1_LINKPOINTERERR_Z1_LINKPOINTERERR_S 0U
#define DCSM_B1_Z1_LINKPOINTERERR_Z1_LINKPOINTERERR_M \
    0x1FFFFFFFU // Error to Resolve Z1 Link
                // pointer from OTP loaded values

//*************************************************************************************************
//
// The following are defines for the bit fields in the B1_Z1_GRABSECTR register
//
//*************************************************************************************************
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT0_S  0U
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT0_M  0x3U // Grab Flash Sector 0 in BANK1
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT1_S  2U
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT1_M  0xCU // Grab Flash Sector 1 in BANK1
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT2_S  4U
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT2_M  0x30U // Grab Flash Sector 2 in BANK1
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT3_S  6U
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT3_M  0xC0U // Grab Flash Sector 3 in BANK1
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT4_S  8U
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT4_M  0x300U // Grab Flash Sector 4 in BANK1
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT5_S  10U
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT5_M  0xC00U // Grab Flash Sector 5 in BANK1
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT6_S  12U
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT6_M  0x3000U // Grab Flash Sector 6 in BANK1
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT7_S  14U
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT7_M  0xC000U // Grab Flash Sector 7 in BANK1
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT8_S  16U
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT8_M  0x30000U // Grab Flash Sector 8 in BANK1
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT9_S  18U
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT9_M  0xC0000U // Grab Flash Sector 9 in BANK1
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT10_S 20U
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT10_M 0x300000U // Grab Flash Sector 10 in BANK1
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT11_S 22U
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT11_M 0xC00000U // Grab Flash Sector 11 in BANK1
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT12_S 24U
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT12_M 0x3000000U // Grab Flash Sector 12 in BANK1
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT13_S 26U
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT13_M 0xC000000U // Grab Flash Sector 13 in BANK1
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT14_S 28U
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT14_M 0x30000000U // Grab Flash Sector 14 in BANK1
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT15_S 30U
#define DCSM_B1_Z1_GRABSECTR_GRAB_SECT15_M 0xC0000000U // Grab Flash Sector 15 in BANK1

//*************************************************************************************************
//
// The following are defines for the bit fields in the B1_Z1_EXEONLYSECTR register
//
//*************************************************************************************************
#define DCSM_B1_Z1_EXEONLYSECTR_EXEONLY_SECT0 \
    0x1U // Execute-Only Flash Sector 0 in Flash
         // BANK1
#define DCSM_B1_Z1_EXEONLYSECTR_EXEONLY_SECT1 \
    0x2U // Execute-Only Flash Sector 1 in Flash
         // BANK1
#define DCSM_B1_Z1_EXEONLYSECTR_EXEONLY_SECT2 \
    0x4U // Execute-Only Flash Sector 2 in Flash
         // BANK1
#define DCSM_B1_Z1_EXEONLYSECTR_EXEONLY_SECT3 \
    0x8U // Execute-Only Flash Sector 3 in Flash
         // BANK1
#define DCSM_B1_Z1_EXEONLYSECTR_EXEONLY_SECT4 \
    0x10U // Execute-Only Flash Sector 4 in Flash
          // BANK1
#define DCSM_B1_Z1_EXEONLYSECTR_EXEONLY_SECT5 \
    0x20U // Execute-Only Flash Sector 5 in Flash
          // BANK1
#define DCSM_B1_Z1_EXEONLYSECTR_EXEONLY_SECT6 \
    0x40U // Execute-Only Flash Sector 6 in Flash
          // BANK1
#define DCSM_B1_Z1_EXEONLYSECTR_EXEONLY_SECT7 \
    0x80U // Execute-Only Flash Sector 7 in Flash
          // BANK1
#define DCSM_B1_Z1_EXEONLYSECTR_EXEONLY_SECT8 \
    0x100U // Execute-Only Flash Sector 8 in Flash
           // BANK1
#define DCSM_B1_Z1_EXEONLYSECTR_EXEONLY_SECT9 \
    0x200U // Execute-Only Flash Sector 9 in Flash
           // BANK1
#define DCSM_B1_Z1_EXEONLYSECTR_EXEONLY_SECT10 \
    0x400U // Execute-Only Flash Sector 10 in Flash
           // BANK1
#define DCSM_B1_Z1_EXEONLYSECTR_EXEONLY_SECT11 \
    0x800U // Execute-Only Flash Sector 11 in Flash
           // BANK1
#define DCSM_B1_Z1_EXEONLYSECTR_EXEONLY_SECT12 \
    0x1000U // Execute-Only Flash Sector 12 in Flash
            // BANK1
#define DCSM_B1_Z1_EXEONLYSECTR_EXEONLY_SECT13 \
    0x2000U // Execute-Only Flash Sector 13 in Flash
            // BANK1
#define DCSM_B1_Z1_EXEONLYSECTR_EXEONLY_SECT14 \
    0x4000U // Execute-Only Flash Sector 14 in Flash
            // BANK1
#define DCSM_B1_Z1_EXEONLYSECTR_EXEONLY_SECT15 \
    0x8000U // Execute-Only Flash Sector 15 in Flash
            // BANK1

//*************************************************************************************************
//
// The following are defines for the bit fields in the B1_Z2_LINKPOINTER register
//
//*************************************************************************************************
#define DCSM_B1_Z2_LINKPOINTER_LINKPOINTER_S 0U
#define DCSM_B1_Z2_LINKPOINTER_LINKPOINTER_M 0x1FFFFFFFU // Zone2 LINK Pointer in Flash BANK1

//*************************************************************************************************
//
// The following are defines for the bit fields in the B1_Z2_LINKPOINTERERR register
//
//*************************************************************************************************
#define DCSM_B1_Z2_LINKPOINTERERR_Z2_LINKPOINTERERR_S 0U
#define DCSM_B1_Z2_LINKPOINTERERR_Z2_LINKPOINTERERR_M \
    0x1FFFFFFFU // Error to Resolve Z2 Link
                // pointer from OTP loaded values

//*************************************************************************************************
//
// The following are defines for the bit fields in the B1_Z2_GRABSECTR register
//
//*************************************************************************************************
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT0_S  0U
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT0_M  0x3U // Grab Flash Sector 0 in Flash BANK1
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT1_S  2U
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT1_M  0xCU // Grab Flash Sector 1 in Flash BANK1
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT2_S  4U
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT2_M  0x30U // Grab Flash Sector 2 in Flash BANK1
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT3_S  6U
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT3_M  0xC0U // Grab Flash Sector 3 in Flash BANK1
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT4_S  8U
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT4_M  0x300U // Grab Flash Sector 4 in Flash BANK1
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT5_S  10U
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT5_M  0xC00U // Grab Flash Sector 5 in Flash BANK1
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT6_S  12U
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT6_M  0x3000U // Grab Flash Sector 6 in Flash BANK1
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT7_S  14U
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT7_M  0xC000U // Grab Flash Sector 7 in Flash BANK1
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT8_S  16U
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT8_M  0x30000U // Grab Flash Sector 8 in Flash BANK1
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT9_S  18U
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT9_M  0xC0000U // Grab Flash Sector 9 in Flash BANK1
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT10_S 20U
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT10_M 0x300000U // Grab Flash Sector 10 in Flash BANK1
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT11_S 22U
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT11_M 0xC00000U // Grab Flash Sector 11 in Flash BANK1
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT12_S 24U
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT12_M 0x3000000U // Grab Flash Sector 12 in Flash BANK1
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT13_S 26U
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT13_M 0xC000000U // Grab Flash Sector 13 in Flash BANK1
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT14_S 28U
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT14_M 0x30000000U // Grab Flash Sector 14 in Flash BANK1
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT15_S 30U
#define DCSM_B1_Z2_GRABSECTR_GRAB_SECT15_M 0xC0000000U // Grab Flash Sector 15 in Flash BANK1

//*************************************************************************************************
//
// The following are defines for the bit fields in the B1_Z2_EXEONLYSECTR register
//
//*************************************************************************************************
#define DCSM_B1_Z2_EXEONLYSECTR_EXEONLY_SECT0 \
    0x1U // Execute-Only Flash Sector 0 in Flash
         // BANK1
#define DCSM_B1_Z2_EXEONLYSECTR_EXEONLY_SECT1 \
    0x2U // Execute-Only Flash Sector 1 in Flash
         // BANK1
#define DCSM_B1_Z2_EXEONLYSECTR_EXEONLY_SECT2 \
    0x4U // Execute-Only Flash Sector 2 in Flash
         // BANK1
#define DCSM_B1_Z2_EXEONLYSECTR_EXEONLY_SECT3 \
    0x8U // Execute-Only Flash Sector 3 in Flash
         // BANK1
#define DCSM_B1_Z2_EXEONLYSECTR_EXEONLY_SECT4 \
    0x10U // Execute-Only Flash Sector 4 in Flash
          // BANK1
#define DCSM_B1_Z2_EXEONLYSECTR_EXEONLY_SECT5 \
    0x20U // Execute-Only Flash Sector 5 in Flash
          // BANK1
#define DCSM_B1_Z2_EXEONLYSECTR_EXEONLY_SECT6 \
    0x40U // Execute-Only Flash Sector 6 in Flash
          // BANK1
#define DCSM_B1_Z2_EXEONLYSECTR_EXEONLY_SECT7 \
    0x80U // Execute-Only Flash Sector 7 in Flash
          // BANK1
#define DCSM_B1_Z2_EXEONLYSECTR_EXEONLY_SECT8 \
    0x100U // Execute-Only Flash Sector 8 in Flash
           // BANK1
#define DCSM_B1_Z2_EXEONLYSECTR_EXEONLY_SECT9 \
    0x200U // Execute-Only Flash Sector 9 in Flash
           // BANK1
#define DCSM_B1_Z2_EXEONLYSECTR_EXEONLY_SECT10 \
    0x400U // Execute-Only Flash Sector 10 in Flash
           // BANK1
#define DCSM_B1_Z2_EXEONLYSECTR_EXEONLY_SECT11 \
    0x800U // Execute-Only Flash Sector 11 in Flash
           // BANK1
#define DCSM_B1_Z2_EXEONLYSECTR_EXEONLY_SECT12 \
    0x1000U // Execute-Only Flash Sector 12 in Flash
            // BANK1
#define DCSM_B1_Z2_EXEONLYSECTR_EXEONLY_SECT13 \
    0x2000U // Execute-Only Flash Sector 13 in Flash
            // BANK1
#define DCSM_B1_Z2_EXEONLYSECTR_EXEONLY_SECT14 \
    0x4000U // Execute-Only Flash Sector 14 in Flash
            // BANK1
#define DCSM_B1_Z2_EXEONLYSECTR_EXEONLY_SECT15 \
    0x8000U // Execute-Only Flash Sector 15 in Flash
            // BANK1

#endif
